garyPenhook/PIC-Assembler/edc/PIC18F14Q41.PIC
        <edc:SFRDef edc:access="nnnn-nn-" edc:cname="SPI2INTE" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="SPI2INTE" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x98">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIE" edc:mask="0x1" edc:name="TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIE" edc:mask="0x1" edc:name="RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EOSIE" edc:mask="0x1" edc:name="EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSIE" edc:mask="0x1" edc:name="SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCZIE" edc:mask="0x1" edc:name="TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMTIE" edc:mask="0x1" edc:name="SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXUIE" edc:mask="0x1" edc:name="SPI2TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2RXOIE" edc:mask="0x1" edc:name="SPI2RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2EOSIE" edc:mask="0x1" edc:name="SPI2EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SOSIE" edc:mask="0x1" edc:name="SPI2SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TCZIE" edc:mask="0x1" edc:name="SPI2TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SRMTIE" edc:mask="0x1" edc:name="SPI2SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SPI2CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SPI2CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x99">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:mask="0xf" edc:name="CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL1" edc:mask="0x1" edc:name="CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL2" edc:mask="0x1" edc:name="CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL3" edc:mask="0x1" edc:name="CLKSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL" edc:mask="0xf" edc:name="SPI2CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL0" edc:mask="0x1" edc:name="SPI2CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL1" edc:mask="0x1" edc:name="SPI2CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL2" edc:mask="0x1" edc:name="SPI2CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLKSEL3" edc:mask="0x1" edc:name="SPI2CLKSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x9A"/>
        <edc:JoinedSFRDef edc:cname="DAC2DAT" edc:desc="" edc:name="DAC2DAT" edc:nzwidth="0x10" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xA0">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC2DATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC2DATL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xA0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAC2R" edc:mask="0xff" edc:name="DAC2R" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC2R0" edc:mask="0x1" edc:name="DAC2R0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R1" edc:mask="0x1" edc:name="DAC2R1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R2" edc:mask="0x1" edc:name="DAC2R2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R3" edc:mask="0x1" edc:name="DAC2R3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R4" edc:mask="0x1" edc:name="DAC2R4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R5" edc:mask="0x1" edc:name="DAC2R5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R6" edc:mask="0x1" edc:name="DAC2R6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R7" edc:mask="0x1" edc:name="DAC2R7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DAC2RL" edc:mask="0xff" edc:name="DAC2RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0xA1"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n---nn-n" edc:cname="DAC2CON" edc:desc="" edc:impl="0xc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---00-0" edc:name="DAC2CON" edc:nzwidth="8" edc:por="0---00-0" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xA2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC2NSS" edc:mask="0x1" edc:name="DAC2NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS0" edc:mask="0x1" edc:name="DAC2PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC2PSS1" edc:mask="0x1" edc:name="DAC2PSS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DAC2EN" edc:mask="0x1" edc:name="DAC2EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-nnnn" edc:cname="OPA1CON0" edc:desc="" edc:impl="0xa8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000" edc:name="OPA1CON0" edc:nzwidth="8" edc:por="0-0-0000" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SOC" edc:desc="" edc:mask="0x7" edc:name="SOC" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="UG" edc:mask="0x1" edc:name="UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SOC0" edc:desc="" edc:mask="0x1" edc:name="SOC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOC1" edc:desc="" edc:mask="0x1" edc:name="SOC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOC2" edc:mask="0x1" edc:name="SOC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UG0" edc:mask="0x1" edc:name="UG0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1SOC" edc:desc="" edc:mask="0x7" edc:name="OPA1SOC" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="OPA1UG" edc:mask="0x1" edc:name="OPA1UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1CPON" edc:mask="0x1" edc:name="OPA1CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1EN" edc:desc="" edc:mask="0x1" edc:name="OPA1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1SOC0" edc:desc="" edc:mask="0x1" edc:name="OPA1SOC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1SOC1" edc:desc="" edc:mask="0x1" edc:name="OPA1SOC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPA1SOC2" edc:mask="0x1" edc:name="OPA1SOC2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OPA1CON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OPA1CON1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:mask="0x7" edc:name="NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RESON" edc:mask="0x1" edc:name="RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL" edc:mask="0x7" edc:name="GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS2" edc:mask="0x1" edc:name="NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL0" edc:mask="0x1" edc:name="GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL1" edc:mask="0x1" edc:name="GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL2" edc:mask="0x1" edc:name="GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1NSS" edc:mask="0x7" edc:name="OPA1NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1RESON" edc:mask="0x1" edc:name="OPA1RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL" edc:mask="0x7" edc:name="OPA1GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1NSS0" edc:mask="0x1" edc:name="OPA1NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NSS1" edc:mask="0x1" edc:name="OPA1NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NSS2" edc:mask="0x1" edc:name="OPA1NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL0" edc:mask="0x1" edc:name="OPA1GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL1" edc:mask="0x1" edc:name="OPA1GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL2" edc:mask="0x1" edc:name="OPA1GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="OPA1CON2" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="OPA1CON2" edc:nzwidth="8" edc:por="-000-000" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:mask="0x7" edc:name="PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCH" edc:mask="0x7" edc:name="NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCH0" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH0" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PCH" edc:mask="0x7" edc:name="OPA1PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH" edc:mask="0x7" edc:name="OPA1NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PCH0" edc:mask="0x1" edc:name="OPA1PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH1" edc:mask="0x1" edc:name="OPA1PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH2" edc:mask="0x1" edc:name="OPA1PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH0" edc:mask="0x1" edc:name="OPA1NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH1" edc:mask="0x1" edc:name="OPA1NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH2" edc:mask="0x1" edc:name="OPA1NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
