garyPenhook/PIC-Assembler/edc/PIC18F14Q41.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA5PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x206">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA5PPS0" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS1" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS2" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS3" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS4" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS5" edc:mask="0x1" edc:name="RA5PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x207"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x208"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x209"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x20A"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x20B"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x20C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RB4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RB4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x20D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB4PPS0" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS1" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS2" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS3" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS4" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS5" edc:mask="0x1" edc:name="RB4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RB5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RB5PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x20E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB5PPS0" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS1" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS2" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS3" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS4" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS5" edc:mask="0x1" edc:name="RB5PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RB6PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RB6PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x20F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB6PPS0" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS1" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS2" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS3" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS4" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS5" edc:mask="0x1" edc:name="RB6PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RB7PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RB7PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x210">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB7PPS0" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS1" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS2" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS3" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS4" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS5" edc:mask="0x1" edc:name="RB7PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
