garyPenhook/PIC-Assembler/edc/PIC18F14Q41.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="I2C1SDAPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="I2C1SDAPPS" edc:nzwidth="8" edc:por="--001100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x270">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS" edc:mask="0x3f" edc:name="I2C1SDAPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS0" edc:mask="0x1" edc:name="I2C1SDAPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS1" edc:mask="0x1" edc:name="I2C1SDAPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS2" edc:mask="0x1" edc:name="I2C1SDAPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS3" edc:mask="0x1" edc:name="I2C1SDAPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS4" edc:mask="0x1" edc:name="I2C1SDAPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SDAPPS5" edc:mask="0x1" edc:name="I2C1SDAPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="I2C1SCLPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="I2C1SCLPPS" edc:nzwidth="8" edc:por="--001110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x271">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS" edc:mask="0x3f" edc:name="I2C1SCLPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS0" edc:mask="0x1" edc:name="I2C1SCLPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS1" edc:mask="0x1" edc:name="I2C1SCLPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS2" edc:mask="0x1" edc:name="I2C1SCLPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS3" edc:mask="0x1" edc:name="I2C1SCLPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS4" edc:mask="0x1" edc:name="I2C1SCLPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1SCLPPS5" edc:mask="0x1" edc:name="I2C1SCLPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U1RXPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U1RXPPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x272">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXPPS" edc:mask="0x3f" edc:name="U1RXPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1RXPPS0" edc:mask="0x1" edc:name="U1RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS1" edc:mask="0x1" edc:name="U1RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS2" edc:mask="0x1" edc:name="U1RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS3" edc:mask="0x1" edc:name="U1RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS4" edc:mask="0x1" edc:name="U1RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXPPS5" edc:mask="0x1" edc:name="U1RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U1CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U1CTSPPS" edc:nzwidth="8" edc:por="--001111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x273">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1CTSPPS" edc:mask="0x3f" edc:name="U1CTSPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U1CTSPPS0" edc:mask="0x1" edc:name="U1CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS1" edc:mask="0x1" edc:name="U1CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS2" edc:mask="0x1" edc:name="U1CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS3" edc:mask="0x1" edc:name="U1CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS4" edc:mask="0x1" edc:name="U1CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1CTSPPS5" edc:mask="0x1" edc:name="U1CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
