garyPenhook/PIC-Assembler/edc/PIC18F14Q41.PIC
        <edc:AdjustPoint edc:offset="0x26" edc:_addr="0x2DA"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x3" edc:beginaddr="0x0300" edc:endaddr="0x0400" edc:regionid="sfr3">
        <edc:JoinedSFRDef edc:cname="SMT1TMR" edc:desc="" edc:name="SMT1TMR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x300">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x300">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR0" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR1" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR2" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR3" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR4" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR5" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR6" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR7" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x301">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR8" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR9" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR10" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR11" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR12" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR13" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR14" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR15" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1TMRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT1TMRU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x302">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1TMR" edc:desc="" edc:mask="0xff" edc:name="SMT1TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1TMR16" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR17" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR18" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR19" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR20" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR21" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR22" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1TMR23" edc:desc="" edc:mask="0x1" edc:name="SMT1TMR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1CPR" edc:desc="" edc:name="SMT1CPR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x303">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x303">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPR0" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR1" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR2" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR3" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR4" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR5" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR6" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR7" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x304">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPR8" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR9" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR10" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR11" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR12" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR13" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR14" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR15" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPRU" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x305">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPR" edc:desc="" edc:mask="0xff" edc:name="SMT1CPR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SMT1CPR16" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR17" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR18" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR19" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR20" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR21" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR22" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPR23" edc:desc="" edc:mask="0x1" edc:name="SMT1CPR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SMT1CPW" edc:desc="" edc:name="SMT1CPW" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x306">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SMT1CPWL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SMT1CPWL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x306">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1CPW" edc:desc="" edc:mask="0xff" edc:name="SMT1CPW" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1CPW0" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW1" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW2" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW3" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW4" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW5" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW6" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1CPW7" edc:desc="" edc:mask="0x1" edc:name="SMT1CPW7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
