garyPenhook/PIC-Assembler/edc/PIC18F14Q41.PIC
        <edc:JoinedSFRDef edc:cname="FSR0SH" edc:desc="" edc:name="FSR0SH" edc:nzwidth="0x10" edc:_addr="0x37C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0SH" edc:desc="" edc:mask="0x3fff" edc:name="FSR0SH" edc:nzwidth="0xE"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="FSR0L_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x37C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR0L" edc:desc="" edc:mask="0xff" edc:name="FSR0L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR0H_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="FSR0H_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x37D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR0H" edc:mask="0x3f" edc:name="FSR0H" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="FSR1SH" edc:desc="" edc:name="FSR1SH" edc:nzwidth="0x10" edc:_addr="0x37E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1SH" edc:desc="" edc:mask="0x3fff" edc:name="FSR1SH" edc:nzwidth="0xE"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="FSR1L_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x37E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR1L" edc:desc="" edc:mask="0xff" edc:name="FSR1L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR1H_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="FSR1H_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x37F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR1H" edc:mask="0x3f" edc:name="FSR1H" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="FSR2SH" edc:desc="" edc:name="FSR2SH" edc:nzwidth="0x10" edc:_addr="0x380">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR2SH" edc:desc="" edc:mask="0x3fff" edc:name="FSR2SH" edc:nzwidth="0xE"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR2L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="00000000" edc:name="FSR2L_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x380">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2L" edc:desc="" edc:mask="0xff" edc:name="FSR2L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="FSR2H_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="FSR2H_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x381">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="FSR2H" edc:mask="0x3f" edc:name="FSR2H" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PRODSH" edc:desc="" edc:name="PRODSH" edc:nzwidth="0x10" edc:_addr="0x382">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PROD" edc:desc="" edc:mask="0xffff" edc:name="PROD" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PRODL_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="PRODL_SHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x382">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRODL" edc:desc="" edc:mask="0xff" edc:name="PRODL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PRODH_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="PRODH_SHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x383">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRODH" edc:desc="" edc:mask="0xff" edc:name="PRODH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x384"/>
        <edc:SFRDef edc:access="-------n" edc:cname="CWG1CLK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="CWG1CLK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1CLKCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1CS" edc:mask="0x1" edc:name="CWG1CS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CWG1ISM" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CWG1ISM" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1DAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISM" edc:mask="0xf" edc:name="ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1ISM" edc:mask="0xf" edc:name="CWG1ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISM0" edc:mask="0x1" edc:name="ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM1" edc:mask="0x1" edc:name="ISM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM2" edc:mask="0x1" edc:name="ISM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM3" edc:mask="0x1" edc:name="ISM3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBR" edc:mask="0x3f" edc:name="CWG1DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBR0" edc:mask="0x1" edc:name="CWG1DBR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR1" edc:mask="0x1" edc:name="CWG1DBR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR2" edc:mask="0x1" edc:name="CWG1DBR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR3" edc:mask="0x1" edc:name="CWG1DBR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR4" edc:mask="0x1" edc:name="CWG1DBR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG1DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG1DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3BF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF" edc:desc="" edc:mask="0x3f" edc:name="DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG1DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1DBF0" edc:mask="0x1" edc:name="CWG1DBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF1" edc:mask="0x1" edc:name="CWG1DBF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF2" edc:mask="0x1" edc:name="CWG1DBF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF3" edc:mask="0x1" edc:name="CWG1DBF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF4" edc:mask="0x1" edc:name="CWG1DBF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1DBF5" edc:mask="0x1" edc:name="CWG1DBF5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="CWG1CON0" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="CWG1CON0" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1MODE" edc:mask="0x7" edc:name="CWG1MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CWG1LD" edc:mask="0x1" edc:name="CWG1LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1EN" edc:mask="0x1" edc:name="CWG1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1MODE0" edc:mask="0x1" edc:name="CWG1MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE1" edc:mask="0x1" edc:name="CWG1MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1MODE2" edc:mask="0x1" edc:name="CWG1MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--r-nnnn" edc:cname="CWG1CON1" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--x-0000" edc:name="CWG1CON1" edc:nzwidth="0x8" edc:por="--x-0000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IN" edc:desc="" edc:mask="0x1" edc:name="IN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1POLA" edc:mask="0x1" edc:name="CWG1POLA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLB" edc:mask="0x1" edc:name="CWG1POLB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLC" edc:mask="0x1" edc:name="CWG1POLC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLD" edc:desc="" edc:mask="0x1" edc:name="CWG1POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IN" edc:mask="0x1" edc:name="CWG1IN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="CWG1AS0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000101--" edc:name="CWG1AS0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LSAC" edc:desc="" edc:mask="0x3" edc:name="LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LSDBD" edc:desc="" edc:mask="0x3" edc:name="LSDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REN" edc:desc="" edc:mask="0x1" edc:name="REN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHUTDOWN" edc:desc="" edc:mask="0x1" edc:name="SHUTDOWN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LSAC0" edc:desc="" edc:mask="0x1" edc:name="LSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSCA1" edc:desc="" edc:mask="0x1" edc:name="LSCA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB0" edc:desc="" edc:mask="0x1" edc:name="LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB1" edc:desc="" edc:mask="0x1" edc:name="LSDB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC0" edc:mask="0x1" edc:name="CWG1LSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC1" edc:mask="0x1" edc:name="CWG1LSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSDB0" edc:mask="0x1" edc:name="CWG1LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSDB1" edc:mask="0x1" edc:name="CWG1LSDB1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSAC" edc:mask="0x3" edc:name="CWG1LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CWG1LSDB" edc:mask="0x3" edc:name="CWG1LSDB" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LSBD" edc:desc="" edc:mask="0x3" edc:name="LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LSAC1" edc:desc="" edc:mask="0x1" edc:name="LSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD0" edc:desc="" edc:mask="0x1" edc:name="LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD1" edc:desc="" edc:mask="0x1" edc:name="LSBD1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD0" edc:mask="0x1" edc:name="CWG1LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD1" edc:mask="0x1" edc:name="CWG1LSBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG1LSBD" edc:mask="0x3" edc:name="CWG1LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
